# Combing DataFrames

## Concatenation

In [1]:
import pandas as pd
import numpy as np

In [7]:
data_one = {"A":["A0", "A1", "A2"], "B": ["B0", "B1", "B2"]}

In [3]:
data_two = {"C": ["C0", "C1", "C2"], "D": ["D0", "D1", "D2"]}

In [4]:
data_one

{'A': ['A0', 'A1', 'A2'], 'B': ['B0', 'B1']}

In [5]:
data_two

{'C': ['C0', 'C1', 'C2'], 'D': ['D0', 'D1', 'D2']}

In [8]:
one = pd.DataFrame(data_one)

In [9]:
two = pd.DataFrame(data_two)

In [10]:
one

    A   B
0  A0  B0
1  A1  B1
2  A2  B2

In [11]:
two

    C   D
0  C0  D0
1  C1  D1
2  C2  D2

In [15]:
pd.concat([one, two], axis=1)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2

In [16]:
one

    A   B
0  A0  B0
1  A1  B1
2  A2  B2

In [17]:
two

    C   D
0  C0  D0
1  C1  D1
2  C2  D2

In [24]:
pd.concat([one, two], axis=0) # Does not really make sense since the columns names do not really make sense

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
0  C0  D0
1  C1  D1
2  C2  D2

In [21]:
two.columns = one.columns
# If the columns have different names, but do match up, we can rename them such that they have the same name

In [22]:
two

    A   B
0  C0  D0
1  C1  D1
2  C2  D2

In [29]:
mydf = pd.concat([one, two], axis=0) # This will allow us to concat the data frame along the columns

In [30]:
mydf.index = range(len(mydf))

In [31]:
mydf

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  C0  D0
4  C1  D1
5  C2  D2

## Inner Merge

In [ ]:
# similar to SQL

In [ ]:
# An inner merge means that everything matches on the column we are merging in each column

In [32]:
registrations = pd.DataFrame({'reg_id':[1,2,3,4],'name':['Andrew','Bobo','Claire','David']})
logins = pd.DataFrame({'log_id':[1,2,3,4],'name':['Xavier','Andrew','Yolanda','Bobo']})

In [33]:
registrations

   reg_id    name
0       1  Andrew
1       2    Bobo
2       3  Claire
3       4   David

In [34]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [36]:
pd.merge(registrations, logins, how='inner', on='name') # Taking things that only are present in both tables

   reg_id    name  log_id
0       1  Andrew       2
1       2    Bobo       4

A left merge means that everything that is on the left hand table must show up in the new table. Right is pretty much that same thing

In [38]:
pd.merge(registrations, logins, how='left', on='name')

   reg_id    name  log_id
0       1  Andrew     2.0
1       2    Bobo     4.0
2       3  Claire     NaN
3       4   David     NaN

In [39]:
pd.merge(registrations, logins, how='right', on='name')

   reg_id     name  log_id
0     NaN   Xavier       1
1     1.0   Andrew       2
2     NaN  Yolanda       3
3     2.0     Bobo       4

An outer merge means we just grab everything from each table

In [40]:
pd.merge(registrations, logins, how='outer', on='name')

   reg_id     name  log_id
0     1.0   Andrew     2.0
1     2.0     Bobo     4.0
2     3.0   Claire     NaN
3     4.0    David     NaN
4     NaN   Xavier     1.0
5     NaN  Yolanda     3.0

This refers to discussing how we join stuff on an index, rather than using any other column

In [41]:
registrations = registrations.set_index("name")

In [42]:
registrations

        reg_id
name
Andrew       1
Bobo         2
Claire       3
David        4

In [43]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [45]:
pd.merge(registrations, logins, left_index=True, right_on='name', how="inner")

   reg_id  log_id    name
1       1       2  Andrew
3       2       4    Bobo

In [47]:
registrations = registrations.reset_index()

In [48]:
registrations.columns = ['reg_name', 'reg_id']

In [49]:
registrations

  reg_name  reg_id
0   Andrew       1
1     Bobo       2
2   Claire       3
3    David       4

In [51]:
results = pd.merge(registrations, logins, left_on='reg_name',right_on='name')

In [52]:
results.drop('reg_name', axis=1)

   reg_id  log_id    name
0       1       2  Andrew
1       2       4    Bobo

In [53]:
registrations

  reg_name  reg_id
0   Andrew       1
1     Bobo       2
2   Claire       3
3    David       4

In [54]:
registrations.columns = ['name', 'id']

In [55]:
registrations

     name  id
0  Andrew   1
1    Bobo   2
2  Claire   3
3   David   4

In [57]:
logins.columns = ['id', 'name']

In [58]:
logins

   id     name
0   1   Xavier
1   2   Andrew
2   3  Yolanda
3   4     Bobo

In [60]:
pd.merge(registrations, logins, on='name', how='inner', suffixes=('_reg', '_login'))

     name  id_reg  id_login
0  Andrew       1         2
1    Bobo       2         4